; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v7)
		(pred_1 ?v5)
		(pred_5 ?v6)
		(pred_2 ?v6)
		(pred_3 ?v5 ?v6)
		(pred_6)
		(pred_4 ?v5))

   (:action op_1
       :parameters  (?v8 ?v2)
       :precondition (and (not-eq ?v8 ?v2) 
                          (pred_5 ?v8) (pred_5 ?v2) (pred_2 ?v8))
       :effect (and  (pred_2 ?v2)
		     (not (pred_2 ?v8))))


   (:action op_3
       :parameters (?v1 ?v3)
       :precondition  (and  (pred_1 ?v1) (pred_5 ?v3)
			    (pred_3 ?v1 ?v3) (pred_2 ?v3) (pred_6))
       :effect (and (pred_4 ?v1)
		    (not (pred_3 ?v1 ?v3)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v1  ?v3)
       :precondition  (and  (pred_1 ?v1) (pred_5 ?v3)
			    (pred_4 ?v1) (pred_2 ?v3))
       :effect (and (pred_3 ?v1 ?v3)
		    (pred_6)
		    (not (pred_4 ?v1)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_01 obj_04 obj_06 obj_03 
          obj_07 obj_02 obj_05 
)
(:init
(pred_5 obj_01)
(pred_5 obj_04)
(pred_5 obj_06)
(pred_5 obj_03)
(pred_1 obj_07)
(pred_1 obj_02)
(pred_1 obj_05)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(pred_6)
(pred_3 obj_07 obj_04)
(pred_3 obj_02 obj_06)
(pred_3 obj_05 obj_06)
(pred_2 obj_04)
)
(:goal
(and
(pred_3 obj_07 obj_03)
(pred_3 obj_02 obj_06)
(pred_3 obj_05 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_07 obj_03) (pred_2 obj_01))
    (sometime-before  (pred_3 obj_05 obj_04) (pred_2 obj_01))
  )
)
)

; plan
1. (op_1 obj_04 obj_06)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_06)
   goals met: 1 of 3
2. (op_3 obj_05 obj_06)
   deleted: (pred_3 obj_05 obj_06) (pred_6)
   added: (pred_4 obj_05)
   goals met: 1 of 3
3. (op_1 obj_06 obj_01)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_01)
   goals met: 1 of 3
4. (op_2 obj_05 obj_01)
   deleted: (pred_4 obj_05)
   added: (pred_3 obj_05 obj_01) (pred_6)
   goals met: 1 of 3
5. (op_1 obj_01 obj_04)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_04)
   goals met: 1 of 3
6. (op_3 obj_07 obj_04)
   deleted: (pred_3 obj_07 obj_04) (pred_6)
   added: (pred_4 obj_07)
   goals met: 1 of 3
7. (op_1 obj_04 obj_03)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_03)
   goals met: 1 of 3
8. (op_2 obj_07 obj_03)
   deleted: (pred_4 obj_07)
   added: (pred_3 obj_07 obj_03) (pred_6)
   goals met: 2 of 3
9. (op_1 obj_03 obj_01)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_01)
   goals met: 2 of 3
10. (op_3 obj_05 obj_01)
   deleted: (pred_3 obj_05 obj_01) (pred_6)
   added: (pred_4 obj_05)
   goals met: 2 of 3
11. (op_1 obj_01 obj_04)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_04)
   goals met: 2 of 3
12. (op_2 obj_05 obj_04)
   deleted: (pred_4 obj_05)
   added: (pred_3 obj_05 obj_04) (pred_6)
   goals met: 3 of 3
